Model: "20210425_04-47-51_lstm"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_lstm (LSTM)            (None, 100, 512)          1251328   
_________________________________________________________________
lstm_4 (LSTM)                (None, 100, 512)          2099200   
_________________________________________________________________
lstm_5 (LSTM)                (None, 512)               2099200   
_________________________________________________________________
batch_normalization_4 (Batch (None, 512)               2048      
_________________________________________________________________
dropout_4 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 256)               131328    
_________________________________________________________________
activation_2 (Activation)    (None, 256)               0         
_________________________________________________________________
batch_normalization_5 (Batch (None, 256)               1024      
_________________________________________________________________
dropout_5 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_output (Dense)         (None, 98)                25186     
_________________________________________________________________
reshaped_output (Reshape)    (None, 1, 98)             0         
=================================================================
Total params: 5,609,314
Trainable params: 5,607,778
Non-trainable params: 1,536
_________________________________________________________________
