Model: "20210425_04-45-38_lstm"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_lstm (LSTM)            (None, 100, 512)          1251328   
_________________________________________________________________
lstm_2 (LSTM)                (None, 100, 512)          2099200   
_________________________________________________________________
lstm_3 (LSTM)                (None, 512)               2099200   
_________________________________________________________________
batch_normalization_2 (Batch (None, 512)               2048      
_________________________________________________________________
dropout_2 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 256)               131328    
_________________________________________________________________
activation_1 (Activation)    (None, 256)               0         
_________________________________________________________________
batch_normalization_3 (Batch (None, 256)               1024      
_________________________________________________________________
dropout_3 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_output (Dense)         (None, 98)                25186     
=================================================================
Total params: 5,609,314
Trainable params: 5,607,778
Non-trainable params: 1,536
_________________________________________________________________
