Model: "20210425_04-54-17_lstm"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_lstm (LSTM)            (None, 100, 512)          1251328   
_________________________________________________________________
lstm (LSTM)                  (None, 100, 512)          2099200   
_________________________________________________________________
lstm_1 (LSTM)                (None, 512)               2099200   
_________________________________________________________________
batch_normalization (BatchNo (None, 512)               2048      
_________________________________________________________________
dropout (Dropout)            (None, 512)               0         
_________________________________________________________________
dense (Dense)                (None, 256)               131328    
_________________________________________________________________
activation (Activation)      (None, 256)               0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 256)               1024      
_________________________________________________________________
dropout_1 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_output (Dense)         (None, 98)                25186     
_________________________________________________________________
reshaped_output (Reshape)    (None, 1, 98)             0         
=================================================================
Total params: 5,609,314
Trainable params: 5,607,778
Non-trainable params: 1,536
_________________________________________________________________
