Model: "20210426_09-02-32_lstm_ae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_lstm (LSTM)            (None, 100, 256)          363520    
_________________________________________________________________
lstm (LSTM)                  (None, 128)               197120    
_________________________________________________________________
repeat_vector (RepeatVector) (None, 1, 128)            0         
_________________________________________________________________
lstm_1 (LSTM)                (None, 1, 256)            394240    
_________________________________________________________________
time_distributed (TimeDistri (None, 1, 98)             25186     
=================================================================
Total params: 980,066
Trainable params: 980,066
Non-trainable params: 0
_________________________________________________________________
