Model: "20210502_08-05-19_lstm_ae"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_lstm (LSTM)            (None, 32, 256)           363520    
_________________________________________________________________
lstm (LSTM)                  (None, 128)               197120    
_________________________________________________________________
repeat_vector (RepeatVector) (None, 32, 128)           0         
_________________________________________________________________
lstm_1 (LSTM)                (None, 32, 256)           394240    
_________________________________________________________________
time_distributed (TimeDistri (None, 32, 98)            25186     
=================================================================
Total params: 980,066
Trainable params: 980,066
Non-trainable params: 0
_________________________________________________________________
