Model: "20210425_05-38-00_ff_lstm"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_lstm (LSTM)            (None, 100, 256)          363520    
_________________________________________________________________
lstm (LSTM)                  (None, 100, 256)          525312    
_________________________________________________________________
lstm_1 (LSTM)                (None, 256)               525312    
_________________________________________________________________
batch_normalization (BatchNo (None, 256)               1024      
_________________________________________________________________
dropout (Dropout)            (None, 256)               0         
_________________________________________________________________
dense (Dense)                (None, 256)               65792     
_________________________________________________________________
batch_normalization_1 (Batch (None, 256)               1024      
_________________________________________________________________
dropout_1 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_output (Dense)         (None, 98)                25186     
_________________________________________________________________
reshaped_output (Reshape)    (None, 1, 98)             0         
=================================================================
Total params: 1,507,170
Trainable params: 1,506,146
Non-trainable params: 1,024
_________________________________________________________________
